

def calc_mod(stat):
    mod = (stat - 10) // 2
    return mod

races = {
    "дварф": "Дварф",
    "полурослик": "Полурослик",
    "человек": "Человек",
    "эльф": "Эльф",
    "гном": "Гном",
    "драконорожденный": "Драконорожденный",
    "полуорк": "Полуорк",
    "полуэльф": "Полуэльф",
    "тифлинг": "Тифлинг"
}

# stats order: Strength, Dexterity, Constitution, Intelligence, Wisdom, Charisma
race_bonuses = {
    'Дварф': [0, 0, 2, 0, 0, 0],
    'Полурослик': [0, 2, 0, 0, 0, 0],
    'Человек': [1, 1, 1, 1, 1, 1],
    'Эльф': [0, 2, 0, 0, 0, 0],
    'Гном': [0, 0, 0, 2, 0, 1],
    'Драконорожденный': [2, 0, 0, 0, 0, 1],
    'Полуорк': [2, 0, 1, 0, 0, 0],
    'Полуэльф': [0, 0, 0, 0, 0, 2], #к 2 по выбору +1
    'Тифлинг': [0, 0, 0, 1, 0, 2],
}

race_base_speed = {
    'Дварф': 25,
    'Полурослик': 25,
    'Человек': 30,
    'Эльф': 30,
    'Гном': 25,
    'Драконорожденный': 30,
    'Полуорк': 30,
    'Полуэльф': 30,
    'Тифлинг': 30,
}

race_to_subrace = {
    "дварф": ["Горный дварф", "Холмовой дварф"],
    "полурослик": ["Крепкий полурослик", "Легконогий полурослик"],
    #"человек": "Человек",
    "эльф": ["Высший эльф", "Лесной эльф", "Дроу"],
    "гном": ["Скальный гном", "Лесной гном"],
    # "драконорождённый": "Драконорожденный",
    # "полуорк": "Полуорк",
    # "полуэльф": "Полуэльф",
    # "тифлинг": "Тифлинг"
}

subraces = {
    'горный дварф': 'Горный дварф',
    'лесной гном': 'Лесной гном',
    'скальный гном': 'Скальный гном',
    'крепкий полурослик': 'Крепкий полурослик',
    'высший эльф': 'Высший эльф',
    'лесной эльф': 'Лесной эльф',
    'холмовой дварф': 'Холмовой дварф',
    'дроу': 'Дроу',
    'легконогий полурослик': 'Легконогий полурослик',
}

subrace_bonuses = {
    'Горный дварф': [2, 0, 0, 0, 0, 0],
    'Лесной гном': [0, 1, 0, 0, 0, 0],
    'Скальный гном': [0, 0, 1, 0, 0, 0],
    'Крепкий полурослик': [0, 0, 1, 0, 0, 0],
    'Высший эльф': [0, 2, 0, 0, 0, 0],
    'Лесной эльф': [0, 0, 0, 0, 1, 0],
    'Холмовой дварф': [0, 0, 0, 0, 1, 0],
    'Дроу': [0, 0, 0, 0, 0, 1],
    'Легконогий полурослик': [0, 0, 0, 0, 0, 1],
}

subrace_speed = {
    'Лесной эльф': 35
}

# races_extended = {
#             "дварф": {
#                 'name': "Дварф",
#                 'race_bonus': [1, 0, 0, 0, 0, 1], 
#                 'subraces': {
#                     '':
#                 }
#                 }
#             "полурослик": "Полурослик",
#             "человек": "Человек",
#             "эльф": "Эльф",
#             "гном": "Гном",
#             "драконорождённый": "Драконорожденный",
#             "полуорк": "Полуорк",
#             "полуэльф": "Полуэльф",
#             "тифлинг": "Тифлинг"
#         }

classes = {
    "бард": "Бард",
    "варвар": "Варвар",
    "воин": "Воин",
    "волшебник": "Волшебник",
    "друид": "Друид",
    "жрец": "Жрец",
    "колдун": "Колдун",
    "монах": "Монах",
    "паладин": "Паладин",
    "плут": "Плут",
    "следопыт": "Следопыт",
    "чародей": "Чародей",
        }

class_spell_stat = {
    "бард": "Харизма",
    "волшебник": "Интеллект",
    "друид": "Мудрость",
    "жрец": "Мудрость",
    "колдун": "Харизма",
    "монах": "Мудрость",
    "паладин": "Харизма",
    "следопыт": "Мудрость",
    "чародей": "Харизма",
}

abilities = {
    "сила": "Сила",
    "ловкость": "Ловкость",
    "выносливость": "Выносливость",
    "интеллект": "Интеллект",
    "мудрость": "Мудрость",
    "харизма": "Харизма",
}

skills = {
    "акробатика": "Акробатика",
    "атлетика": "Атлетика",
    "внимание": "Внимание",
    "выживание": "Выживание",
    "дрессировка": "Дрессировка",
    "запугивание": "Запугивание",
    "исполнение": "Исполнение",
    "история": "История",
    "ловкость рук": "Ловкость рук",
    "магия": "Магия",
    "медицина": "Медицина",
    "обман": "Обман",
    "ррирода": "Природа",
    "проницательность": "Проницательность",
    "расследование": "Расследование",
    "религия": "Религия",
    "скрытность": "Скрытность",
    "убеждение": "Убеждение",   
}

code_word_list = [
    'сил','сила', 
    'лвк','лов','ловкость', 
    'вын','выносливость', 
    'инт','интеллект', 
    'мдр','муд','мудр','мудрость',
    'хар','харизма',        
    'акр','акробатика',   
    'атл','атлетика',
    'вни','внимание',
    'выж','выживание',
    'дре','дрессировка',
    'зап','запугивание',
    'исп','исполнение',
    'ист','история',
    'лр','ловрук','лврк','лвкрук','ловкрук','рук','лрук','лрк','ловкость рук',
    'маг','магия',
    'мед','медицина',
    'обм','обман',
    'при','природа',
    'про','проницательность',
    'рас','рассл','расследование',
    'рел','религия',
    'скр','скрытность',
    'убе','убеж','убеждение',
    'исил','испсил','испытание силы',
    'илвк','илов','исплвк','исплов','испытание ловкости',
    'ивын','испвын','испытание выносливости',
    'иинт','испинт','испытание интеллекта',
    'имдр','имуд','испмдр','испмуд','испытание мудрости',
    'ихар','испхар','испытание харизмы',
    'ини','иниц','инициатива',
    'затака','атаказ','зтк','атака заклинанием',"заклатака",
    'атака','атк',
    ]

code_fast_value = [
    'зм','пм','эм','см','мм',
    'пз','хп',
    'вр','вз',
    'кз',
    'кб',
    'по','оп',
    'ttg','ттг'
]
code_fast_no_value = [
    'длиный отдых','до',
    'короткий отдых','ко',
    'снар','снаряжение', 'сн',
    'деньги','монеты','мон',
    'lvlup','лвлап','повышение','повыш','новый уровень','новур',
    'закл','заклин','зак', 'заклинания',

]
money_array = ['п','пм',
              'з','зм',
              'э','эм',
              'с','см',
              'м','мм',
              ]

xp_threshold = [0,300,900,2700,6500,14000,23000,34000,48000,64000,85000,100000,120000,140000,165000,195000,225000,265000,305000,355000]

def proficiency_bonus(lvl):
    if lvl <=4:
        return 2
    if lvl <=8:
        return 3
    if lvl <=12:
        return 4
    if lvl <=16:
        return 5
    if lvl <=20:
        return 2
    return 2